app/views/photos/show.html.erb

SELECT "photos".* FROM "photos"
---

  <% if current_user.photos.count > 0 %>