app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)
    @photo.save
---
INSERT INTO "photos" ("image_file", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image_file", nil], ["user_id", 2], ["description", "lovely birds"], ["created_at", "2016-01-05 21:04:14.650072"], ["updated_at", "2016-01-05 21:04:14.650072"]]

  def new
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def show
    @photo = Photo.new
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def all
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"