app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @photo = Photo.find_by(id: @review.photo_id)
    if @review.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 23]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "reviews" ("photo_id", "user_id", "rating", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["photo_id", 19], ["user_id", 3], ["rating", "meh"], ["comment", "i love you wolfie!"], ["created_at", "2016-01-06 22:59:06.681267"], ["updated_at", "2016-01-06 22:59:06.681267"]]