app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "karen@donutville.com"]]
---
  def sign_in
    @user = User.find_by(email: params[:email])