app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "user@user.com"], ["created_at", "2016-01-04 22:57:59.896666"], ["updated_at", "2016-01-04 22:57:59.896666"]]